# File: data.py
# In a real application, this data might come from a database,
#  API, or a file (e.g., JSON, CSV).


SCHEDULE = {
    "9А": {
        "teacher": "Крук Мария Аркадьевна",
        "schedule": {
            "Понедельник": [
                "1. Регионоведение - 5",
                "2. Алгебра - 5",
                "3. Физкультура - спортзал",
                "4. Литература - 4",
                "5. Химия - 1",
                "6. География - 10"
            ],
            "Вторник": [
                "1. История - 12",
                "2. Физика - 63",
                "3. Биология - 26",
                "4. География - 10",
                "5. Информатика - 17",
                "6. ОБЖ - 39"
            ],
            "Среда": [
                "1. Физика - 63",
                "2. История - 12",
                "3. Английский язык - 23",
                "4. ОБЖ - 39",
                "5. Геометрия - 5",
                "6. Химия - 1"
            ],
            "Четверг": [
                "1. Обществознание - 12",
                "2. Немецкий язык - 38",
                "3. Вероятность и статистика - 39",
                "4. Русский язык - 4",
                "5. Индивидуальный проект - 4",
                "6. Литература - 4"
            ],
            "Пятница": [
                "1. Алгебра - 5",
                "2. Геометрия - 5",
                "3. Английский язык - 23",
                "4. Биология - 26",
                "5. Физкультура - спортзал",
                "6. Информатика - 17"
            ],
            "Суббота": [
                "1. Химия - 1",
                "2. Геометрия - 5",
                "3. Обществознание - 12",
                "4. Вероятность и статистика - 39",
                "5. Индивидуальный проект - 4"
            ]
        }
    },
    "9Б": {
        "teacher": "Загарских Светлана Анатольевна",
        "schedule": {
            "Понедельник": [
                "1. Разговоры о важном - 4",
                "2. Английский язык - 23",
                "3. Биология - 26",
                "4. География - 10",
                "5. Алгебра - 5",
                "6. Геометрия - 5"
            ],
            "Вторник": [
                "1. Химия - 1",
                "2. Вероятность и статистика - 39",
                "3. Обществознание - 12",
                "4. ОБЖ - 39",
                "5. Физика - 63",
                "6. Литература - 4",
                "7. Литература - 4"
            ],
            "Среда": [
                "<b><i>Класс учится с третьего урока</i></b>",
                "3. Индивидуальный проект - 4",
                "4. Алгебра - 5",
                "5. Алгебра - 5",
                "6. Физкультура - спортзал младшей школы"
            ],
            "Четверг": [
                "<b><i>Класс учится со второго урока</i></b>",
                "2. Русский язык - 4",
                "3. Русский язык - 4",
                "4. Английский язык - 23",
                "5. Информатика - 17",
                "6. Геометрия - 5",
                "7. Физкультура - спортзал младшей школы"
            ],
            "Пятница": [
                "1. Вероятность и статистика - 39",
                "2. Английский язык - 23",
                "3. Литература - 4",
                "4. Химия - 1",
                "5. Биология - 26",
                "6. Физика - 63"
            ],
            "Суббота": [
                "1. Русский язык - 4",
                "2. География - 10",
                "3. Немецкий язык - 38",
                "4. История - 12",
                "5. История - 12"
            ]
        }
    },
    "9В": {
        "teacher": "Видлацкая Ольга Ивановна",
        "schedule": {
            "Понедельник": [  
                "1. Физика - 63",  
                "2. История - 12",  
                "3. Немецкий язык - 38",  
                "4. Литература - 4",  
                "5. Геометрия - 5",  
                "6. Химия - 1"  
            ],  
            "Вторник": [  
                "<b><i>Класс учится с третьего урока</i></b>",  
                "3. Физкультура - спортзал",  
                "4. Обществознание - 12",  
                "5. Информатика - 17",  
                "6. Русский язык - 4"  
            ],  
            "Среда": [  
                "1. Алгебра - 5",  
                "2. Биология - 26",  
                "3. Английский язык - 23",  
                "4. География - 10",  
                "5. ОБЖ - 39",  
                "6. Физика - 63"  
            ],  
            "Четверг": [  
                "1. Регионоведение - 5",  
                "2. Вероятность и статистика - 39",  
                "3. Литература - 4",  
                "4. Химия - 1",  
                "5. Индивидуальный проект - 4",  
                "6. История - 12"  
            ],  
            "Пятница": [  
                "<b><i>Класс учится со второго урока</i></b>",  
                "2. Физкультура - спортзал",  
                "3. Геометрия - 5",  
                "4. Информатика - 17",  
                "5. Английский язык - 23"  
            ],  
            "Суббота": [  
                "1. Обществознание - 12",  
                "2. Русский язык - 4",  
                "3. Алгебра - 5",  
                "4. Биология - 26",  
                "5. Регионоведение - 5"  
            ]
        } 
    },

    "9Г": {
        "teacher": None,
        "schedule": {
            "Понедельник": [  
                "1. Физика - 63",  
                "2. История - 12",  
                "3. Немецкий язык - 38",  
                "4. Алгебра - 5",  
                "5. Литература - 4",  
                "6. Физкультура - стадион"  
            ],  
            "Вторник": [  
                "<b><i>Класс учится с третьего урока</i></b>",  
                "3. География - 10",  
                "4. ОБЖ - 39",  
                "5. Химия - 1",  
                "6. Русский язык - 4"  
            ],  
            "Среда": [  
                "1. Английский язык - 23",  
                "2. Информатика - 17",  
                "3. Биология - 26",  
                "4. Вероятность и статистика - 39",  
                "5. Геометрия - 5",  
                "6. Регионоведение - 5"  
            ],  
            "Четверг": [ 
                "1. Обществознание - 12",  
                "2. Физика - 63",  
                "3. Алгебра - 5",  
                "4. Литература - 4",  
                "5. Индивидуальный проект - 4"  
            ],  
            "Пятница": [  
                "1. Химия - 1",  
                "2. Геометрия - 5",  
                "3. Английский язык - 23",  
                "4. История - 12",  
                "5. Физкультура - спортзал младшей школы"  
            ],  
            "Суббота": [  
                "1. Биология - 26",  
                "2. Регионоведение - 5",  
                "3. Русский язык - 4",  
                "4. ОБЖ - 39",  
                "5. Информатика - 17"  
            ]  
        }
    },
    "9Д": {
        "teacher": "Щепина Любовь Владимировна",
        "schedule": {
            "Понедельник": [  
                "1. География - 10",  
                "2. Информатика - 17",  
                "3. Физкультура - спортзал",  
                "4. Литература - 4",  
                "5. Алгебра - 5",  
                "6. Химия - 1"  
            ],  
            "Вторник": [  
                "1. Английский язык - 23",  
                "2. Обществознание - 12",  
                "3. Физика - 63",  
                "4. Немецкий язык - 38",  
                "5. Геометрия - 5",  
                "6. История - 12"  
            ],  
            "Среда": [  
                "1. Индивидуальный проект - 4",  
                "2. Индивидуальный проект - 4",  
                "3. Вероятность и статистика - 39",  
                "4. Русский язык - 4",  
                "5. Биология - 26"  
            ],  
            "Четверг": [  
                "1. ОБЖ - 39",  
                "2. Регионоведение - 5",  
                "3. Алгебра - 5",  
                "4. Физкультура - спортзал",  
                "5. Литература - 4",  
                "6. География - 10"  
            ],  
            "Пятница": [  
                "1. История - 12",  
                "2. Химия - 1",  
                "3. Английский язык - 23",  
                "4. Информатика - 17",  
                "5. Физика - 63"  
            ],  
            "Суббота": [  
                "1. Русский язык - 4",  
                "2. Обществознание - 12",  
                "3. Немецкий язык - 38",  
                "4. Вероятность и статистика - 39",  
                "5. Геометрия - 5"  
            ]  
        }
    },
    "9Е": {
        "teacher": "Николаева Екатерина Игоревна",
        "schedule": {
            "Понедельник": [
                "1. Регионоведение - 5",
                "2. Алгебра - 5",
                "3. Физкультура - спортзал",
                "4. Литература - 4",
                "5. Химия - 1"
            ],
            "Вторник": [
                "<b><i>Класс учится с 4 урока</i></b>",
                "4. Биология - 26",
                "5. География - 10",
                "6. Информатика - 17"
            ],
            "Среда": [
                "1. Физика - 63",
                "2. История - 12",
                "3. Английский язык - 23",
                "4. ОБЖ - 39",
                "5. Геометрия - 5"
            ],
            "Четверг": [
                "1. Обществознание - 12",
                "2. Немецкий язык - 38",
                "3. Вероятность и статистика - 39",
                "4. Русский язык - 4",
                "5. Индивидуальный проект - 4"
            ],
            "Пятница": [  
                "1. История - 12",  
                "2. Химия - 1",  
                "3. Английский язык - 23",  
                "4. Информатика - 17",  
                "5. Физика - 63"  
            ],  
            "Суббота": [
                "1. Химия - 1",
                "2. Геометрия - 5",
                "3. Обществознание - 12",
                "4. Вероятность и статистика - 39",
                "5. Индивидуальный проект - 4"
            ]
        }
    },
    "9З": {
        "teacher": "Бурдина Екатерина Леонидовна",
        "schedule": {
            "Понедельник": [
                "1. Информатика - 17",
                "2. Физика - 63",
                "3. Литература - 4",
                "4. Алгебра - 5",
                "5. Физкультура - спортзал"
            ],
            "Вторник": [
                "1. Химия - 1",
                "2. Геометрия - 5",
                "3. Английский язык - 23",
                "4. История - 12",
                "5. ОБЖ - 39"
            ],
            "Среда": [
                "1. Физика - 63",
                "2. История - 12",
                "3. Английский язык - 23",
                "4. ОБЖ - 39",
                "5. Геометрия - 5"
            ],
            "Четверг": [
                "1. Немецкий язык - 38",
                "2. Регионоведение - 5",
                "3. Вероятность и статистика - 39",
                "4. География - 10",
                "5. Индивидуальный проект - 4"
            ],
            "Пятница": [
                "1. Физика - 63",
                "2. Литература - 4",
                "3. Алгебра - 5",
                "4. Химия - 1",
                "5. Физкультура - спортзал"
            ],
            "Суббота": [
                "1. Регионоведение - 5",
                "2. Английский язык - 23",
                "3. ОБЖ - 39",
                "4. Информатика - 17",
                "5. Биология - 26"
            ]
        }
    }
}

CLASSES = list(SCHEDULE.keys())

def get_classes() -> list[str]:
    """Returns the list of available classes."""
    return CLASSES

def get_schedule_for_class(class_name: str) -> dict | None:
    """
    Retrieves the schedule for a specific class.
    Returns the schedule dictionary or None if the class is not found.
    """
    return SCHEDULE.get(class_name)

def get_teacher_for_class(class_name: str) -> str | None:
    """
    Retrieves the teacher for a specific class.
    Returns the teacher's name or None if the class is not found.
    """
    class_data = SCHEDULE.get(class_name)
    return class_data.get("teacher") if class_data else None

def format_schedule_text(class_name: str, schedule_data: dict) -> str:
    """Formats the schedule data into a readable string."""
    teacher = get_teacher_for_class(class_name)
    text = [f"<b>📅 Расписание для {class_name}\n👩‍🏫 Классный руководитель:\n{teacher}</b>"]
    for day, lessons in schedule_data["schedule"].items():
        text.append(f"\n<b>📌 {day}:</b>")
        text.extend([f"• {lesson}" for lesson in lessons])
    return "\n".join(text)



